#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/briananderson-xyz/brian-dev-1222/runs/run-MFPczpMg691iuwPw

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
google_project_service.cloudresource: Refreshing state... [id=brian-dev-1222/cloudresourcemanager.googleapis.com]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/brian-dev-1222/locations/global/workloadIdentityPools/github-brian1222]
google_service_account.cluster: Refreshing state... [id=projects/brian-dev-1222/serviceAccounts/cluster@brian-dev-1222.iam.gserviceaccount.com]
data.google_client_config.current: Refreshing...
google_service_account.cicd: Refreshing state... [id=projects/brian-dev-1222/serviceAccounts/pipeline@brian-dev-1222.iam.gserviceaccount.com]
google_artifact_registry_repository.artifact-repo: Refreshing state... [id=projects/brian-dev-1222/locations/us-central1/repositories/container-registry]
data.google_client_config.current: Refresh complete after 0s [id=projects/"brian-dev-1222"/regions/"us-central1"/zones/<null>]
google_service_account_iam_member.cicd-workload-identity: Refreshing state... [id=projects/brian-dev-1222/serviceAccounts/pipeline@brian-dev-1222.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/876147542335/locations/global/workloadIdentityPools/github-brian1222/attribute.repository_owner/briananderson1222]
google_iam_workload_identity_pool_provider.github-automation: Refreshing state... [id=projects/brian-dev-1222/locations/global/workloadIdentityPools/github-brian1222/providers/github-automation]
google_container_cluster.primary: Refreshing state... [id=projects/brian-dev-1222/locations/us-central1/clusters/autopilot-cluster-1]
google_artifact_registry_repository_iam_member.cicd: Refreshing state... [id=projects/brian-dev-1222/locations/us-central1/repositories/container-registry/roles/artifactregistry.writer/serviceAccount:pipeline@brian-dev-1222.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.cluster: Refreshing state... [id=projects/brian-dev-1222/locations/us-central1/repositories/container-registry/roles/artifactregistry.reader/serviceAccount:cluster@brian-dev-1222.iam.gserviceaccount.com]
google_project_iam_binding.cluster-roles["roles/monitoring.viewer"]: Refreshing state... [id=brian-dev-1222/roles/monitoring.viewer]
google_project_iam_member.cicd-container-developer: Refreshing state... [id=brian-dev-1222/roles/container.developer/serviceAccount:pipeline@brian-dev-1222.iam.gserviceaccount.com]
google_project_iam_binding.cluster-roles["roles/logging.logWriter"]: Refreshing state... [id=brian-dev-1222/roles/logging.logWriter]
google_project_iam_binding.cluster-roles["roles/monitoring.metricWriter"]: Refreshing state... [id=brian-dev-1222/roles/monitoring.metricWriter]
google_project_iam_binding.cluster-roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=brian-dev-1222/roles/stackdriver.resourceMetadata.writer]
google_project_iam_binding.cluster-roles["roles/autoscaling.metricsWriter"]: Refreshing state... [id=brian-dev-1222/roles/autoscaling.metricsWriter]
google_iam_workload_identity_pool_provider.github-automation: Drift detected (update)
google_service_account_iam_member.cicd-workload-identity: Drift detected (update)
google_artifact_registry_repository.artifact-repo: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_iam_workload_identity_pool_provider.github-automation will be updated in-place
  ~ resource "google_iam_workload_identity_pool_provider" "github-automation" {
      + attribute_condition                = "'briananderson1222' in attribute.repository_owner"
        id                                 = "projects/brian-dev-1222/locations/global/workloadIdentityPools/github-brian1222/providers/github-automation"
        name                               = "projects/876147542335/locations/global/workloadIdentityPools/github-brian1222/providers/github-automation"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_namespace.development will be created
  + resource "kubernetes_namespace" "development" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "development"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.production will be created
  + resource "kubernetes_namespace" "production" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "production"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.json

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.json"

```

</details>

*Pusher: @briananderson1222, Action: `pull_request`, Working Directory: ``, Workflow: `Demo Infrastructure Pipeline`*